Q1. List any five functions of the pandas library with execution.

In [ ]:
Value_counts.
groupby.
loc and iloc.
unique and nunique.
Cut and qcut.

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [2]:
import pandas as pd

In [4]:
df = {'a' : [1,2,3,4] ,
      'b' : [5,6,7,8] , 
      'c' : [9,10,11,12]}
df1 = pd.DataFrame(df,index = ['a','b','c','d'])

In [5]:
pd.DataFrame(df1)

   a  b   c
a  1  5   9
b  2  6  10
c  3  7  11
d  4  8  12

In [6]:
df1.reindex(['b','d','c','a'])

   a  b   c
b  2  6  10
d  4  8  12
c  3  7  11
a  1  5   9

In [7]:
df1

   a  b   c
a  1  5   9
b  2  6  10
c  3  7  11
d  4  8  12

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [88]:
def calculate_sum_of_first_three_values(df):
    first_three_values= df['values'][:3]
    sum_of_first_three_values = sum(first_three_values)
    print("The sum of first three values is the 'values' column is: {60}")
df = pd.DataFrame({'values' : [10,20,30,40,50]})
calculate_sum_of_first_three_values(df)

The sum of first three values is the 'values' column is: {60}

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [14]:
data = {
'colors' : ['red', 'blue', 'yellow', 'pink', 'blue', 'black', 'white', 'red', 'pink'],
'animals' : ['dog', 'cat', 'rabbit', 'cow', 'lion', 'cat', 'cow', 'lion', 'dog']
}

In [17]:
df = pd.DataFrame(data)

In [18]:
df

   colors animals
0     red     dog
1    blue     cat
2  yellow  rabbit
3    pink     cow
4    blue    lion
5   black     cat
6   white     cow
7     red    lion
8    pink     dog

In [19]:
df['World_Count'] = 0

In [20]:
df

   colors animals  World_Count
0     red     dog            0
1    blue     cat            0
2  yellow  rabbit            0
3    pink     cow            0
4    blue    lion            0
5   black     cat            0
6   white     cow            0
7     red    lion            0
8    pink     dog            0

Q5. How are DataFrame.size() and DataFrame.shape() different?

The size property is used to get an int representing the number of elements in this object and Return the number of rows 
if Series.
The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

Q6. Which function of pandas do we use to read an excel file?

We can use the pandas module read_excel() function to read the excel file data into a DataFrame object.

In [1]:
import pandas as pd

In [3]:
df = pd.read_excel("DayBook.xlsx")

In [4]:
df

,Xyz,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Day Book,NaN,NaN,NaN,NaN,NaN
1,For 1-Apr-22,NaN,NaN,NaN,NaN,NaN
2,Date,Particulars,Vch Type,Vch No.,Debit,Credit
3,NaN,NaN,NaN,NaN,Amount,Amount
4,2022-04-01 00:00:00,Cash,Contra,1,NaN,100000
5,2022-04-01 00:00:00,Cash,Contra,2,NaN,50000
6,2022-04-01 00:00:00,Computer Ac,Payment,1,22500,NaN
7,2022-04-01 00:00:00,Security Deposit Office,Payment,2,25000,NaN
8,2022-04-01 00:00:00,Cell Phone,Payment,3,6000,NaN
9,2022-04-01 00:00:00,Security Deposit Mobile,Payment,4,3000,NaN
10,2022-04-01 00:00:00,Withdrawl,Payment,5,7500,NaN
11,2022-04-01 00:00:00,Office Maintance,Payment,6,750,NaN
12,2022-04-01 00:00:00,Arpit Kumar Verma,Receipt,1,NaN,300000
13,2022-04-01 00:00:00,Adv Consultancy Sevice,Receipt,2,NaN,25000
14,2022-04-01 00:00:00,Stationary Expns,Journal,1,12500,NaN
15,2022-04-01 00:00:00,Stationary Expns,Journal,2,6000,NaN

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [64]:
data = { 'Email_adds' : ['username@domain.com']
       }

In [66]:
df =pd.DataFrame(data)

In [67]:
df['username'] = 'john.doe@example.com'

In [68]:
df

            Email_adds              username
0  username@domain.com  john.doe@example.com

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [61]:
import pandas as pd
def rows(df):
    mask = (df['A'] > 5) & (df['B'] <10)
    row = df[mask]
    return row
df = pd.DataFrame({'A' :[3,8,6,2,4,9], 'B' :[5,2,9,11,15,10], 'C' :[1,2,8,2,9,8] })
row = rows(df)
print(row)

   A  B  C
1  8  2  2
2  6  9  8

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [15]:
data = {'Name': ['mrs' , 'mr' , 'malhotra' , 'jha'],
        'Age' :[20 , 40 ,30 , 35],
        'Grade': [88 , 90 ,95, 55]
       }

In [16]:
df =pd.DataFrame(data , index =['mrs' , 'mr' , 'malhotra' , 'jha'] )

In [17]:
df

              Name  Age  Grade
mrs            mrs   20     88
mr              mr   40     90
malhotra  malhotra   30     95
jha            jha   35     55

In [18]:
df['Grade'].mean()

82.0

In [19]:
df['Grade'].median()

89.0

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [53]:
import pandas as pd

In [54]:
def moving_average(df):
    df['Moving Average'] = df['sales'].rolling(window=7 , min_periods =1).mean()
    return df
df = pd.DataFrame({'Date' : pd.date_range('20230401' , periods=10),
                   'sales' : [10,20,30,40,50,70,80,90,100,110]})
df = moving_average(df)
print(df)

        Date  sales  Moving Average
0 2023-04-01     10       10.000000
1 2023-04-02     20       15.000000
2 2023-04-03     30       20.000000
3 2023-04-04     40       25.000000
4 2023-04-05     50       30.000000
5 2023-04-06     70       36.666667
6 2023-04-07     80       42.857143
7 2023-04-08     90       54.285714
8 2023-04-09    100       65.714286
9 2023-04-10    110       77.142857

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:
    Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [44]:
data1 = {"Date" :[2023-1-1 , 2023-1-2 , 2023-1-3 , 2023-1-4 , 2023-1-5]
        }

In [45]:
df = pd.DataFrame(data1)

In [40]:
df['Weekday'] = 0

In [46]:
df['Weekday'] = ['Sunday' , 'Monday' ,'Tuesday' ,'Wednesday' ,'Thursday']

In [47]:
df

   Date    Weekday
0  2021     Sunday
1  2020     Monday
2  2019    Tuesday
3  2018  Wednesday
4  2017   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [48]:
date = pd.date_range(start='2023-01-01' , end = '2023-01-31')

In [49]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first() method returns the first n rows, based on the specified value,
Pandas is built on top of two core Python libraries—matplotlib for data visualization and NumPy 
for mathematical operations.